export const typeCourses = [
  {
    id: 1,
    type: "กลุ่มวิชาเฉพาะประเภทวิชาแกน",
    description:
      "เป็นรายวิชาที่จัดขึ้นเพื่อเสริมสร้างความรู้ ทักษะและสมรรถนะ เฉพาะทางของหลักสูตร เพื่อให้ผู้เรียนมีความรู้ความเข้าใจทาง พื้นฐานเหมือนกันก่อนจะไปสู่การเรียนในเชิงลึก",
  },
  {
    id: 2,
    type: "กลุ่มวิชาเฉพาะประเภทวิชาเฉพาะด้าน",
    description:
      "เป็นายวิชาที่เป็นหัวใจหลักของสาขาวิชานั้น ๆ หลักสูตรจะกำหนดขึ้นเพื่อพัฒนาความรู้และทักษะที่ผู้เรียนต้องมีในวิชาชีพหรือศาสตร์เฉพาะด้าน",
  },
  {
    id: 3,
    type: "กลุ่มวิชาวิทยาการคอมพิวเตอร์",
    description:
      "เป็นรายวิชามุ่งเน้นการพัฒนาความรู้ ความเข้าใจ และทักษะเชิงทฤษฎีและปฏิบัติ เพื่อนำไปใช้แก้ปัญหาในเชิงวิชาการและเชิงวิชาชีพ",
  },
  {
    id: 4,
    type: "กลุ่มวิชาวิทยาศาสตร์ข้อมูล",
    description:
      "เป็นรายวิชาที่มุ่งเน้นการบูรณาการความรู้ด้านคณิตศาสตร์ สถิติ คอมพิวเตอร์ และความรู้เฉพาะสาขา เพื่อ การเก็บรวบรวม วิเคราะห์ ประมวลผล และตีความข้อมูล อย่างเป็นระบบ",
  },
  {
    id: 5,
    type: "กลุ่มวิชาธุรกิจดิจิทัล",
    description:
      "เป็นายวิชาที่มุ่งเน้นการประยุกต์ใช้เทคโนโลยีดิจิทัลร่วมกับศาสตร์ด้านการจัดการและการตลาด เพื่อพัฒนาความรู้ ทักษะ และสมรรถนะของผู้เรียนในการดำเนินธุรกิจในยุคดิจิทัล",
  },
];

export const excuteSeedTypeCourses = async (prisma: any) => {
  for (const typeCourse of typeCourses) {
    await prisma.typeCourse.upsert({
      where: { id: typeCourse.id },
      update: {},
      create: {
        id: typeCourse.id,
        type: typeCourse.type,
        description: typeCourse.description,
      },
    });
  }
};
